{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Query some information from the triples"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "As a reminder, here are our compentency questions:"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "\n",
    "| **ID** | **Competency question**                                                  | **Reference** |\n",
    "|--------|--------------------------------------------------------------------------|---------------|\n",
    "| 1      | In what language is written a song?                                      | Core          |\n",
    "| 2      | Which different languages the lyrics from our Knowledge Graph use?       | Core          |\n",
    "| 3      | Who is the primary artist involved in the creative process of a song?    | Music Meta    |\n",
    "| 4      | What are all the different artists involved in writing the lyrics?       | Music Meta    |\n",
    "| 5      | Which are the different sections of a song?                              | Music Lyrics  |\n",
    "| 6      | What are the lyrics associated to an specific section of a song?         | Music Lyrics  |\n",
    "| 7      | What are the starting and ending time stamps of a specific lyric's line? | Music Lyrics  |\n",
    "| 8      | What is the duration of a lyric's line?                                  | Music Lyrics  |\n",
    "| 9      | What is the duration of a song's section?                                | Music Lyrics  |\n",
    "| 10     | What are the singers in charge of singing a specific song's section?     | Music Lyrics  |\n",
    "| 11     | What is the dataset where the annotations were taken from?               | Music Lyrics  |\n",
    "| 12     | From which dataset was extracted each JSON data file?                    | Music Lyrics  |"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Let's try to answer them by performing some SPARQL queries in our knowledge graph's triples."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "from rdflib import Graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Directory containing the RDF files\n",
    "triples_folder = './triples/'\n",
    "\n",
    "# Load all RDF files into a single graph\n",
    "graph = Graph()\n",
    "for file_name in os.listdir(triples_folder):\n",
    "    if file_name.endswith('.ttl') or file_name.endswith('.rdf'):\n",
    "        graph.parse(os.path.join(triples_folder, file_name), format='turtle')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "# SPARQL Queries\n",
    "queries = {\n",
    "    \"song_language\": \"\"\"\n",
    "        SELECT ?title ?language WHERE {\n",
    "            ?song core:hasPart ?abstractScore ;\n",
    "                core:title ?title .\n",
    "            ?abstractScore mm:hasText ?lyrics .\n",
    "            ?lyrics core:hasLanguage ?language .\n",
    "        } LIMIT 25\n",
    "    \"\"\",\n",
    "    \"different_languages\": \"\"\"\n",
    "        SELECT DISTINCT ?language WHERE {\n",
    "            ?song core:hasLanguage ?language .\n",
    "        } LIMIT 25\n",
    "    \"\"\",\n",
    "    \"primary_artist\": \"\"\"\n",
    "        SELECT ?title ?artist WHERE {\n",
    "            ?song core:title ?title ;\n",
    "                mm:isCreatedBy ?creativeProcess .\n",
    "            ?creativeProcess mm:involvesCreativeAction ?creativeActionURI .\n",
    "            ?creativeActionURI mm:involvesAgent ?artistURI ;\n",
    "                core:executesTask ?creativeTask .\n",
    "            ?artistURI core:name ?artist .\n",
    "            ?creativeTask rdf:type mm:Instrumentation\n",
    "        } LIMIT 25\n",
    "    \"\"\",\n",
    "    \"writer_artists\": \"\"\"\n",
    "        SELECT ?title ?writerName WHERE {\n",
    "            ?songURI core:title ?title ;\n",
    "                    mm:isCreatedBy ?creativeProcess .\n",
    "            ?creativeProcess mm:involvesCreativeAction ?creativeAction .\n",
    "            ?creativeAction core:executesTask ?creativeTask ;\n",
    "                            mm:involvesAgent ?writer .\n",
    "            ?creativeTask a mm:LyricsWriting .\n",
    "            ?writer core:name ?writerName .\n",
    "        } LIMIT 25\n",
    "    \"\"\",\n",
    "    \"song_sections\": \"\"\"\n",
    "        SELECT DISTINCT ?section WHERE {\n",
    "            ?lyrics mm:hasTextPart ?paragraph .\n",
    "            ?paragraph a ?section .\n",
    "        } \n",
    "    \"\"\",\n",
    "    \"lyrics_associated_to_section\": \"\"\"\n",
    "        SELECT ?paragraph ?lyricsText WHERE {\n",
    "            ?lyrics mm:hasTextPart ?paragraph .\n",
    "            ?paragraph mm:hasTextPart ?textLine .\n",
    "            ?textLine core:value ?lyricsText .\n",
    "        } LIMIT 25\n",
    "    \"\"\",\n",
    "    \"line_time_stamps\": \"\"\"\n",
    "        SELECT ?lineText ?startValue ?endValue WHERE {\n",
    "            ?lineURI a mm:TextFragment ;\n",
    "                core:value ?lineText;\n",
    "                ml:hasMusicTimeInterval ?intervalURI .\n",
    "            ?intervalURI core:hasStartMusicTimeIndex ?startURI ;\n",
    "                        core:hasEndMusicTimeIndex ?endURI .\n",
    "            ?startURI core:hasMusicTimeIndexComponent ?start .\n",
    "            ?endURI core:hasMusicTimeIndexComponent ?end .\n",
    "            ?start core:value ?startValue .\n",
    "            ?end core:value ?endValue .\n",
    "        } LIMIT 25\n",
    "    \"\"\",\n",
    "    \"line_duration\": \"\"\"\n",
    "        SELECT ?lineText ?duration WHERE {\n",
    "            ?lineURI a mm:TextFragment ;\n",
    "                core:value ?lineText;\n",
    "                ml:hasMusicTimeInterval ?intervalURI .\n",
    "            ?intervalURI core:hasMusicTimeDuration ?durationURI .\n",
    "            ?durationURI core:value ?duration .\n",
    "        } LIMIT 25\n",
    "    \"\"\",\n",
    "    \"section_duration\": \"\"\"\n",
    "        SELECT DISTINCT ?paragraph ?duration WHERE {\n",
    "            ?lyrics mm:hasTextPart ?paragraph .\n",
    "            ?paragraph ml:hasMusicTimeInterval ?musicTimeInterval .\n",
    "            ?musicTimeInterval core:hasMusicTimeDuration ?musicTimeDuration .\n",
    "            ?musicTimeDuration core:value ?duration.\n",
    "        } LIMIT 25\n",
    "    \"\"\",\n",
    "    \"singers_for_section\": \"\"\"\n",
    "        SELECT DISTINCT ?paragraph ?name WHERE {\n",
    "            ?lyrics mm:hasTextPart ?paragraph .\n",
    "            ?paragraph mm:hasTextPart ?textLine ;\n",
    "                ml:sungBy ?musician .\n",
    "            ?musician core:name ?name .\n",
    "        } LIMIT 25\n",
    "    \"\"\",\n",
    "    \"source_dataset\": \"\"\"\n",
    "        SELECT ?songTitle ?datasetName WHERE {\n",
    "            ?musicEntity core:title ?songTitle ;\n",
    "                core:hasPart ?abstractScore .\n",
    "            ?abstractScore prov:wasDerivedFrom ?sourceFile .\n",
    "            ?sourceFile prov:wasDerivedFrom ?sourceDataset .\n",
    "            ?sourceDataset core:name ?datasetName .\n",
    "        } LIMIT 25 \n",
    "    \"\"\",\n",
    "    \"source_file\": \"\"\"\n",
    "        SELECT ?fileID ?datasetName WHERE {\n",
    "            ?abstractScore prov:wasDerivedFrom ?JSONFile .\n",
    "            ?JSONFile ml:hasIdentifier ?fileID ;\n",
    "                        prov:wasDerivedFrom ?dataset .\n",
    "            ?dataset core:name ?datasetName .\n",
    "        } LIMIT 25\n",
    "    \"\"\"\n",
    "}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Results for: Song Language\n",
      "\n",
      "(rdflib.term.Literal('I just fall in love again'), rdflib.term.Literal('en'))\n",
      "(rdflib.term.Literal('One moment in time'), rdflib.term.Literal('en'))\n",
      "(rdflib.term.Literal('If We Hold On Together'), rdflib.term.Literal('en'))\n",
      "(rdflib.term.Literal(\"Can't Be With You Tonight\"), rdflib.term.Literal('en'))\n",
      "(rdflib.term.Literal('Darte un beso'), rdflib.term.Literal('es'))\n",
      "(rdflib.term.Literal('El perdedor'), rdflib.term.Literal('es'))\n",
      "(rdflib.term.Literal('Como la flor'), rdflib.term.Literal('es'))\n",
      "(rdflib.term.Literal('El Poder Nuestro Es'), rdflib.term.Literal('es'))\n",
      "(rdflib.term.Literal('Simplemente Amigos - Ana Gabriel'), rdflib.term.Literal('es'))\n",
      "(rdflib.term.Literal('La oreja de van gogh- rosas'), rdflib.term.Literal('es'))\n",
      "(rdflib.term.Literal('Fuego de noche, nieve de día'), rdflib.term.Literal('es'))\n",
      "(rdflib.term.Literal('Entra en mi vida'), rdflib.term.Literal('es'))\n",
      "(rdflib.term.Literal('Kilómetros'), rdflib.term.Literal('es'))\n",
      "(rdflib.term.Literal('Perdon Perdon'), rdflib.term.Literal('es'))\n",
      "(rdflib.term.Literal('Mientes Tan Bien'), rdflib.term.Literal('es'))\n",
      "(rdflib.term.Literal('seru giran seminare'), rdflib.term.Literal('es'))\n",
      "(rdflib.term.Literal('Yo te esperare'), rdflib.term.Literal('es'))\n",
      "(rdflib.term.Literal('Me Dedique a Perderte'), rdflib.term.Literal('es'))\n",
      "(rdflib.term.Literal('Mi vestido azul'), rdflib.term.Literal('es'))\n",
      "(rdflib.term.Literal('La Vida es un Sueño'), rdflib.term.Literal('es'))\n",
      "(rdflib.term.Literal('No Me Doy Por Vencido'), rdflib.term.Literal('es'))\n",
      "(rdflib.term.Literal('Noviembre Sin Ti'), rdflib.term.Literal('es'))\n",
      "(rdflib.term.Literal('Te vi Venir'), rdflib.term.Literal('es'))\n",
      "(rdflib.term.Literal('Colgando en tus Manos'), rdflib.term.Literal('es'))\n",
      "(rdflib.term.Literal('Sin Miedo a Nada'), rdflib.term.Literal('es'))\n",
      "\n",
      "Results for: Different Languages\n",
      "\n",
      "(rdflib.term.Literal('en'),)\n",
      "(rdflib.term.Literal('es'),)\n",
      "(rdflib.term.Literal('pt'),)\n",
      "(rdflib.term.Literal('ko'),)\n",
      "(rdflib.term.Literal('de'),)\n",
      "(rdflib.term.Literal('tr'),)\n",
      "(rdflib.term.Literal('fr'),)\n",
      "(rdflib.term.Literal('hu'),)\n",
      "(rdflib.term.Literal('ms'),)\n",
      "(rdflib.term.Literal('id'),)\n",
      "(rdflib.term.Literal('it'),)\n",
      "(rdflib.term.Literal('pl'),)\n",
      "(rdflib.term.Literal('ja'),)\n",
      "(rdflib.term.Literal('nl'),)\n",
      "(rdflib.term.Literal('sv'),)\n",
      "(rdflib.term.Literal('no'),)\n",
      "(rdflib.term.Literal('ru'),)\n",
      "(rdflib.term.Literal('th'),)\n",
      "(rdflib.term.Literal('vi'),)\n",
      "(rdflib.term.Literal('fi'),)\n",
      "(rdflib.term.Literal('da'),)\n",
      "\n",
      "Results for: Primary Artist\n",
      "\n",
      "(rdflib.term.Literal('I just fall in love again'), rdflib.term.Literal('Anne Murray'))\n",
      "(rdflib.term.Literal('One moment in time'), rdflib.term.Literal('Whitney Houston'))\n",
      "(rdflib.term.Literal('If We Hold On Together'), rdflib.term.Literal('Diana Ross'))\n",
      "(rdflib.term.Literal(\"Can't Be With You Tonight\"), rdflib.term.Literal('Judy Boucher'))\n",
      "(rdflib.term.Literal('Darte un beso'), rdflib.term.Literal('Prince Royce'))\n",
      "(rdflib.term.Literal('El perdedor'), rdflib.term.Literal('Maluma'))\n",
      "(rdflib.term.Literal('Como la flor'), rdflib.term.Literal('Selena'))\n",
      "(rdflib.term.Literal('El Poder Nuestro Es'), rdflib.term.Literal('Adrián Barba'))\n",
      "(rdflib.term.Literal('Simplemente Amigos - Ana Gabriel'), rdflib.term.Literal('Ana Gabriel'))\n",
      "(rdflib.term.Literal('La oreja de van gogh- rosas'), rdflib.term.Literal('la oreja de van gogh rosas'))\n",
      "(rdflib.term.Literal('Fuego de noche, nieve de día'), rdflib.term.Literal('Ricky Martin'))\n",
      "(rdflib.term.Literal('Entra en mi vida'), rdflib.term.Literal('Sin Bandera'))\n",
      "(rdflib.term.Literal('Kilómetros'), rdflib.term.Literal('Sin Bandera'))\n",
      "(rdflib.term.Literal('Perdon Perdon'), rdflib.term.Literal('Ha-Ash'))\n",
      "(rdflib.term.Literal('Mientes Tan Bien'), rdflib.term.Literal('Sin Bandera'))\n",
      "(rdflib.term.Literal('seru giran seminare'), rdflib.term.Literal('seru giran seminare'))\n",
      "(rdflib.term.Literal('Yo te esperare'), rdflib.term.Literal('Cali y El Dandee'))\n",
      "(rdflib.term.Literal('Me Dedique a Perderte'), rdflib.term.Literal('Alejandro Fernández'))\n",
      "(rdflib.term.Literal('Mi vestido azul'), rdflib.term.Literal('Floricienta'))\n",
      "(rdflib.term.Literal('La Vida es un Sueño'), rdflib.term.Literal('Elenco de Soy Luna☪'))\n",
      "(rdflib.term.Literal('No Me Doy Por Vencido'), rdflib.term.Literal('Luis Fonsi'))\n",
      "(rdflib.term.Literal('Noviembre Sin Ti'), rdflib.term.Literal('Reik'))\n",
      "(rdflib.term.Literal('Te vi Venir'), rdflib.term.Literal('Sin Bandera'))\n",
      "(rdflib.term.Literal('Colgando en tus Manos'), rdflib.term.Literal('Carlos Baute ft. Marta Sanchez'))\n",
      "(rdflib.term.Literal('Sin Miedo a Nada'), rdflib.term.Literal('Alex Ubago'))\n",
      "\n",
      "Results for: Writer Artists\n",
      "\n",
      "(rdflib.term.Literal('I just fall in love again'), rdflib.term.Literal('Gloria Sklerov'))\n",
      "(rdflib.term.Literal('I just fall in love again'), rdflib.term.Literal('Larry Herbstritt'))\n",
      "(rdflib.term.Literal('I just fall in love again'), rdflib.term.Literal('Steve Dorff'))\n",
      "(rdflib.term.Literal('I just fall in love again'), rdflib.term.Literal('Harry Lloyd'))\n",
      "(rdflib.term.Literal('One moment in time'), rdflib.term.Literal('John Bettis'))\n",
      "(rdflib.term.Literal('One moment in time'), rdflib.term.Literal('Albert Hammond'))\n",
      "(rdflib.term.Literal('If We Hold On Together'), rdflib.term.Literal('James Horner'))\n",
      "(rdflib.term.Literal('If We Hold On Together'), rdflib.term.Literal('Barry Mann'))\n",
      "(rdflib.term.Literal('If We Hold On Together'), rdflib.term.Literal('Will Jennings'))\n",
      "(rdflib.term.Literal(\"Can't Be With You Tonight\"), rdflib.term.Literal('Judy Boucher'))\n",
      "(rdflib.term.Literal('Darte un beso'), rdflib.term.Literal('Prince Royce'))\n",
      "(rdflib.term.Literal('Darte un beso'), rdflib.term.Literal('Guianko Gómez'))\n",
      "(rdflib.term.Literal('Darte un beso'), rdflib.term.Literal('Juan Riveros'))\n",
      "(rdflib.term.Literal('Darte un beso'), rdflib.term.Literal('Andrés Castro'))\n",
      "(rdflib.term.Literal('El perdedor'), rdflib.term.Literal('Miky La Sensa'))\n",
      "(rdflib.term.Literal('El perdedor'), rdflib.term.Literal('Chan El Genio'))\n",
      "(rdflib.term.Literal('El perdedor'), rdflib.term.Literal('Kevin ADG'))\n",
      "(rdflib.term.Literal('El perdedor'), rdflib.term.Literal('Maluma'))\n",
      "(rdflib.term.Literal('Como la flor'), rdflib.term.Literal('A.B. Quintanilla III'))\n",
      "(rdflib.term.Literal('Como la flor'), rdflib.term.Literal('Pete Astudillo'))\n",
      "(rdflib.term.Literal('El Poder Nuestro Es'), rdflib.term.Literal('森雪之丞 (Yukinojo Mori)'))\n",
      "(rdflib.term.Literal('El Poder Nuestro Es'), rdflib.term.Literal('石川恵樹 (Keiju Ishikawa)'))\n",
      "(rdflib.term.Literal('El Poder Nuestro Es'), rdflib.term.Literal('Adrián Barba'))\n",
      "(rdflib.term.Literal('Simplemente Amigos - Ana Gabriel'), rdflib.term.Literal('Ana Gabriel'))\n",
      "(rdflib.term.Literal('La oreja de van gogh- rosas'), rdflib.term.Literal('Xabi San Martín'))\n",
      "\n",
      "Results for: Song Sections\n",
      "\n",
      "(rdflib.term.URIRef('https://w3id.org/polifonia/ontology/music-meta/TextFragment'),)\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/Chorus'),)\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/Verse'),)\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/Bridge'),)\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/Pre-Chorus'),)\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/Intro'),)\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/Outro'),)\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/Post-Chorus'),)\n",
      "\n",
      "Results for: Lyrics Associated To Section\n",
      "\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Verse2/70352f41061eda4ff3c322094af068ba70c3b38b'), rdflib.term.Literal(''))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Verse2/70352f41061eda4ff3c322094af068ba70c3b38b'), rdflib.term.Literal('when I look into your eyes'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Verse2/70352f41061eda4ff3c322094af068ba70c3b38b'), rdflib.term.Literal('Heaven is that moment'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Verse2/70352f41061eda4ff3c322094af068ba70c3b38b'), rdflib.term.Literal('Easy, for you to take me to a star'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Verse2/70352f41061eda4ff3c322094af068ba70c3b38b'), rdflib.term.Literal('and the night just seems to fly'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Verse2/70352f41061eda4ff3c322094af068ba70c3b38b'), rdflib.term.Literal('The way I hold you'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Verse2/70352f41061eda4ff3c322094af068ba70c3b38b'), rdflib.term.Literal('Magic, it must be magic'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Verse1/70352f41061eda4ff3c322094af068ba70c3b38b'), rdflib.term.Literal(''))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Verse1/70352f41061eda4ff3c322094af068ba70c3b38b'), rdflib.term.Literal('I know my dream is coming true'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Verse1/70352f41061eda4ff3c322094af068ba70c3b38b'), rdflib.term.Literal(\"And though I'm wide awake\"))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Verse1/70352f41061eda4ff3c322094af068ba70c3b38b'), rdflib.term.Literal('Baby, you take me in your arms'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Verse1/70352f41061eda4ff3c322094af068ba70c3b38b'), rdflib.term.Literal('here with you?'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Verse1/70352f41061eda4ff3c322094af068ba70c3b38b'), rdflib.term.Literal('Or am I really lying'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Verse1/70352f41061eda4ff3c322094af068ba70c3b38b'), rdflib.term.Literal('Dreaming, I must be dreaming'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Chorus2/70352f41061eda4ff3c322094af068ba70c3b38b'), rdflib.term.Literal(''))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Chorus2/70352f41061eda4ff3c322094af068ba70c3b38b'), rdflib.term.Literal('I fall in love with you'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Chorus2/70352f41061eda4ff3c322094af068ba70c3b38b'), rdflib.term.Literal(\"I can't help myself\"))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Chorus2/70352f41061eda4ff3c322094af068ba70c3b38b'), rdflib.term.Literal('I fall in love with you'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Chorus2/70352f41061eda4ff3c322094af068ba70c3b38b'), rdflib.term.Literal('And, oh I…just fall in love again'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Chorus2/70352f41061eda4ff3c322094af068ba70c3b38b'), rdflib.term.Literal('it happens every time'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Chorus2/70352f41061eda4ff3c322094af068ba70c3b38b'), rdflib.term.Literal('(Easy version)'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Chorus2/70352f41061eda4ff3c322094af068ba70c3b38b'), rdflib.term.Literal('and when I do'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Chorus2/70352f41061eda4ff3c322094af068ba70c3b38b'), rdflib.term.Literal(\"I can't help myself\"))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Chorus2/70352f41061eda4ff3c322094af068ba70c3b38b'), rdflib.term.Literal('There I go, I…just fall in love again'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Chorus2/70352f41061eda4ff3c322094af068ba70c3b38b'), rdflib.term.Literal('Just one touch and then'))\n",
      "\n",
      "Results for: Line Time Stamps\n",
      "\n",
      "(rdflib.term.Literal('There I go, I…just fall in love again'), rdflib.term.Literal('56.989583333333336', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('63.639583333333334', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal('here with you?'), rdflib.term.Literal('24.739583333333332', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('28.88958333333333', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal('and when I do'), rdflib.term.Literal('63.739583333333336', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('67.88020833333334', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal('and when I do'), rdflib.term.Literal('131.73020833333334', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('136.63020833333334', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal('Or am I really lying'), rdflib.term.Literal('21.489583333333332', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('24.63958333333333', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal('I fall in love with you'), rdflib.term.Literal('138.73020833333334', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('143.63020833333334', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal('Easy, for you to take me to a star'), rdflib.term.Literal('96.98020833333334', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('104.63020833333334', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal(''), rdflib.term.Literal('70.23020833333334', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('83.13020833333334', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal(''), rdflib.term.Literal('70.23020833333334', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('70.13020833333334', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal('I fall in love with you'), rdflib.term.Literal('70.23020833333334', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('83.13020833333334', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal('I fall in love with you'), rdflib.term.Literal('70.23020833333334', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('70.13020833333334', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal('And, oh I…just fall in love again'), rdflib.term.Literal('111.48020833333334', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('118.88020833333334', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal('and the night just seems to fly'), rdflib.term.Literal('91.73020833333334', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('96.88020833333334', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal(\"I can't help myself\"), rdflib.term.Literal('136.73020833333334', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('138.63020833333334', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal('Magic, it must be magic'), rdflib.term.Literal('83.23020833333334', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('89.38958333333333', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal(\"I can't help myself\"), rdflib.term.Literal('67.98020833333334', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('70.13020833333334', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal('it happens every time'), rdflib.term.Literal('121.73958333333333', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('124.88020833333334', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal('And, oh…I just fall in love again'), rdflib.term.Literal('42.760416666666664', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('50.139583333333334', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal(\"I can't help myself\"), rdflib.term.Literal('143.73020833333334', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('146.13020833333334', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal('Baby, you take me in your arms'), rdflib.term.Literal('28.989583333333332', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('35.889583333333334', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal(''), rdflib.term.Literal('38.739583333333336', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('42.66041666666666', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal(''), rdflib.term.Literal('38.739583333333336', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('38.639583333333334', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal('I know my dream is coming true'), rdflib.term.Literal('38.739583333333336', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('42.66041666666666', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal('I know my dream is coming true'), rdflib.term.Literal('38.739583333333336', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('38.639583333333334', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal('(Easy version)'), rdflib.term.Literal('156.98020833333334', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('171.64', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "\n",
      "Results for: Line Duration\n",
      "\n",
      "(rdflib.term.Literal('There I go, I…just fall in love again'), rdflib.term.Literal('6.649999999999999', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal('here with you?'), rdflib.term.Literal('4.149999999999999', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal('and when I do'), rdflib.term.Literal('4.140625000000007', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal('and when I do'), rdflib.term.Literal('4.900000000000006', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal('Or am I really lying'), rdflib.term.Literal('3.1499999999999986', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal('I fall in love with you'), rdflib.term.Literal('4.900000000000006', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal('Easy, for you to take me to a star'), rdflib.term.Literal('7.650000000000006', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal(''), rdflib.term.Literal('12.900000000000006', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal(''), rdflib.term.Literal('-0.09999999999999432', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal('I fall in love with you'), rdflib.term.Literal('12.900000000000006', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal('I fall in love with you'), rdflib.term.Literal('-0.09999999999999432', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal('And, oh I…just fall in love again'), rdflib.term.Literal('7.400000000000006', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal('and the night just seems to fly'), rdflib.term.Literal('5.150000000000006', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal(\"I can't help myself\"), rdflib.term.Literal('1.9000000000000057', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal('Magic, it must be magic'), rdflib.term.Literal('6.159374999999997', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal(\"I can't help myself\"), rdflib.term.Literal('2.1500000000000057', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal('it happens every time'), rdflib.term.Literal('3.140625000000014', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal('And, oh…I just fall in love again'), rdflib.term.Literal('7.37916666666667', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal(\"I can't help myself\"), rdflib.term.Literal('2.4000000000000057', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal('Baby, you take me in your arms'), rdflib.term.Literal('6.900000000000002', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal(''), rdflib.term.Literal('3.920833333333327', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal(''), rdflib.term.Literal('-0.10000000000000142', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal('I know my dream is coming true'), rdflib.term.Literal('3.920833333333327', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal('I know my dream is coming true'), rdflib.term.Literal('-0.10000000000000142', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.Literal('(Easy version)'), rdflib.term.Literal('14.65979166666665', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "\n",
      "Results for: Section Duration\n",
      "\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/TextFragment/Verse1/e14481f4e21a2f00a9425e912b022dfe270c81c8'), rdflib.term.Literal('6.649999999999997', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/TextFragment/Chorus2/0879d623280ae41740157c33a024bfa91c3018e2'), rdflib.term.Literal('1.9000000000000057', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/TextFragment/Verse2/910f98e98f26a36d33c0b4c78839127a4d7f4439'), rdflib.term.Literal('6.159374999999997', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/TextFragment/Chorus1/64965c4fda09facc97b0c12a6925216001f98e99'), rdflib.term.Literal('2.8999999999999986', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/TextFragment/Chorus2/35876ad1330f91cb8165d20dd609f12b2d1e8fe1'), rdflib.term.Literal('3.140625000000014', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/TextFragment/Chorus1/b95bc1d6ed53c2d62d51cfe6548c7bbb46bad0fd'), rdflib.term.Literal('6.649999999999999', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/TextFragment/Verse1/97a6c115599b467da806ee67ee2fb8e6074253a4'), rdflib.term.Literal('3.1499999999999986', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Verse2/70352f41061eda4ff3c322094af068ba70c3b38b'), rdflib.term.Literal('24.150000000000006', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Chorus2/70352f41061eda4ff3c322094af068ba70c3b38b'), rdflib.term.Literal('34.650000000000006', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Chorus1/70352f41061eda4ff3c322094af068ba70c3b38b'), rdflib.term.Literal('27.36979166666668', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/TextFragment/Chorus1/5fac7dbe1d772ff745d09b4de5a7df5810b2a1f3'), rdflib.term.Literal('4.140625000000007', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/TextFragment/Chorus2/5c71636284977277c9d4af3b6ee89c36f85367c6'), rdflib.term.Literal('2.4000000000000057', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/TextFragment/Verse1/a6ba65728b13691a06d7f29287569e3feebee8d7'), rdflib.term.Literal('2.6499999999999986', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/TextFragment/Chorus2/0b342550f6816def7a7613b8d215aaa0ef2eaad9'), rdflib.term.Literal('14.65979166666665', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/TextFragment/Chorus1/e7ae741447d07b6b19c0019fabffec3cd4df000d'), rdflib.term.Literal('12.900000000000006', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/TextFragment/Chorus1/e7ae741447d07b6b19c0019fabffec3cd4df000d'), rdflib.term.Literal('-0.09999999999999432', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/TextFragment/Verse2/3fdea4fe8689c78f3cb489c4711e67827cd35ce3'), rdflib.term.Literal('2.6500000000000057', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/TextFragment/Chorus2/bace65a43a43e9227284589cab82a32442a096a0'), rdflib.term.Literal('7.400000000000006', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/TextFragment/Verse2/136ea4e649cf479edb00b84bb1e2c964ee864724'), rdflib.term.Literal('3.9000000000000057', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/TextFragment/Verse2/136ea4e649cf479edb00b84bb1e2c964ee864724'), rdflib.term.Literal('-0.09999999999999432', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/TextFragment/Chorus2/a837a63a16815f86bc55550193e707297cab3d79'), rdflib.term.Literal('2.659374999999997', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/TextFragment/Chorus1/9751122d04845a71c9bc20acd7f7f9e979097da9'), rdflib.term.Literal('2.1500000000000057', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/TextFragment/Verse1/304fda3243413362ef33f1401bda61159b110b3d'), rdflib.term.Literal('6.900000000000002', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/TextFragment/Verse1/44130d1cb5704aa2eaf374863a4317e03f76f544'), rdflib.term.Literal('3.920833333333327', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/TextFragment/Verse1/44130d1cb5704aa2eaf374863a4317e03f76f544'), rdflib.term.Literal('-0.10000000000000142', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')))\n",
      "\n",
      "Results for: Singers For Section\n",
      "\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Verse2/70352f41061eda4ff3c322094af068ba70c3b38b'), rdflib.term.Literal('Anne Murray'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Verse1/70352f41061eda4ff3c322094af068ba70c3b38b'), rdflib.term.Literal('Anne Murray'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Chorus2/70352f41061eda4ff3c322094af068ba70c3b38b'), rdflib.term.Literal('Anne Murray'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Chorus1/70352f41061eda4ff3c322094af068ba70c3b38b'), rdflib.term.Literal('Anne Murray'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Verse1/1d102a8cf9879ceec3a7b26104b12e875c13d6a7'), rdflib.term.Literal('Whitney Houston'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Bridge1/1d102a8cf9879ceec3a7b26104b12e875c13d6a7'), rdflib.term.Literal('Whitney Houston'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Chorus2/1d102a8cf9879ceec3a7b26104b12e875c13d6a7'), rdflib.term.Literal('Whitney Houston'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Verse2/1d102a8cf9879ceec3a7b26104b12e875c13d6a7'), rdflib.term.Literal('Whitney Houston'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Chorus1/1d102a8cf9879ceec3a7b26104b12e875c13d6a7'), rdflib.term.Literal('Whitney Houston'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Chorus3/1d102a8cf9879ceec3a7b26104b12e875c13d6a7'), rdflib.term.Literal('Whitney Houston'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Chorus2/567aca07a5f1bdcf33f9b95c4d3c8aee1631c91a'), rdflib.term.Literal('Whitney Houston'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Pre-Chorus1/567aca07a5f1bdcf33f9b95c4d3c8aee1631c91a'), rdflib.term.Literal('Whitney Houston'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Verse2/567aca07a5f1bdcf33f9b95c4d3c8aee1631c91a'), rdflib.term.Literal('Whitney Houston'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Chorus1/567aca07a5f1bdcf33f9b95c4d3c8aee1631c91a'), rdflib.term.Literal('Whitney Houston'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Pre-Chorus2/567aca07a5f1bdcf33f9b95c4d3c8aee1631c91a'), rdflib.term.Literal('Whitney Houston'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Verse1/567aca07a5f1bdcf33f9b95c4d3c8aee1631c91a'), rdflib.term.Literal('Whitney Houston'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Verse2/3c1e8c84c5530bea8849a54d008c9161fefd43cc'), rdflib.term.Literal('Whitney Houston'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Chorus2/3c1e8c84c5530bea8849a54d008c9161fefd43cc'), rdflib.term.Literal('Whitney Houston'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Pre-Chorus1/3c1e8c84c5530bea8849a54d008c9161fefd43cc'), rdflib.term.Literal('Whitney Houston'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Pre-Chorus2/3c1e8c84c5530bea8849a54d008c9161fefd43cc'), rdflib.term.Literal('Whitney Houston'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Outro1/3c1e8c84c5530bea8849a54d008c9161fefd43cc'), rdflib.term.Literal('Whitney Houston'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Verse1/3c1e8c84c5530bea8849a54d008c9161fefd43cc'), rdflib.term.Literal('Whitney Houston'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Chorus1/3c1e8c84c5530bea8849a54d008c9161fefd43cc'), rdflib.term.Literal('Whitney Houston'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Chorus2/51bbc7aef22a0e17f6e3629e1ea33e183eddede4'), rdflib.term.Literal('Whitney Houston'))\n",
      "(rdflib.term.URIRef('http://w3id.org/polifonia/ontology/music-lyrics/AbstractScore/Outro1/51bbc7aef22a0e17f6e3629e1ea33e183eddede4'), rdflib.term.Literal('Whitney Houston'))\n",
      "\n",
      "Results for: Source Dataset\n",
      "\n",
      "(rdflib.term.Literal('I just fall in love again'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('One moment in time'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('If We Hold On Together'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal(\"Can't Be With You Tonight\"), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('Darte un beso'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('El perdedor'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('Como la flor'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('El Poder Nuestro Es'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('Simplemente Amigos - Ana Gabriel'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('La oreja de van gogh- rosas'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('Fuego de noche, nieve de día'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('Entra en mi vida'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('Kilómetros'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('Perdon Perdon'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('Mientes Tan Bien'), rdflib.term.Literal('DALI'))\n",
      "(rdflib.term.Literal('seru giran seminare'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('Yo te esperare'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('Me Dedique a Perderte'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('Mi vestido azul'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('La Vida es un Sueño'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('No Me Doy Por Vencido'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('Noviembre Sin Ti'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('Te vi Venir'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('Colgando en tus Manos'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('Sin Miedo a Nada'), rdflib.term.Literal('DAMP'))\n",
      "\n",
      "Results for: Source File\n",
      "\n",
      "(rdflib.term.Literal('00000000'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('00000001'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('00000002'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('00000003'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('00000004'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('00000005'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('00000006'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('00000007'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('00000008'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('00000009'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('0000000A'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('0000000B'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('0000000C'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('0000000D'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('0000000F'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('00000010'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('00000011'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('00000012'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('00000013'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('00000014'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('00000015'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('00000016'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('00000017'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('00000018'), rdflib.term.Literal('DAMP'))\n",
      "(rdflib.term.Literal('00000019'), rdflib.term.Literal('DAMP'))\n"
     ]
    }
   ],
   "source": [
    "# Execute queries and print results\n",
    "for question, query in queries.items():\n",
    "    print(f\"\\nResults for: {question.replace('_', ' ').title()}\\n\")\n",
    "    results = graph.query(query)\n",
    "    for row in results:\n",
    "        print(row)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
